# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Import Dataset

In [2]:
dataset = pd.read_csv('C:/Users/49176/Desktop/ML_Assignment2/ML_Assignment2_IT19135830_IT19190808_IT19136134_IT19146652/insurance.csv')
print(dataset)

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

# Define x and y

In [3]:
dataset.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

# Preprocessing Dataset

In [4]:
#Creating dummy variables for the catergorical variable sex
dataset['Gender']=np.where(dataset['sex']=='female',1,0)

#Drop original column of sex
dataset.drop(columns=['sex'],axis=1,inplace=True)

In [5]:
#Creating dummy variables for the catergorical variable smoke
dataset['Smoker']=np.where(dataset['smoker']=='yes',1,0)

#Drop original column of smoke
dataset.drop(columns=['smoker'],axis=1,inplace=True)

In [6]:
dataset.head()

   age     bmi  children     region      charges  Gender  Smoker
0   19  27.900         0  southwest  16884.92400       1       1
1   18  33.770         1  southeast   1725.55230       0       0
2   28  33.000         3  southeast   4449.46200       0       0
3   33  22.705         0  northwest  21984.47061       0       0
4   32  28.880         0  northwest   3866.85520       0       0

In [7]:
#Create dummy variables for the categorical varable region
dataset['Northeast'] = np.where(dataset['region']=='northeast',1,0)
dataset['Northwest'] = np.where(dataset['region']=='northwest',1,0)
dataset['Southeast'] = np.where(dataset['region']=='southeast',1,0)
dataset['Southwest'] = np.where(dataset['region']=='southwest',1,0)

#Drop original column of region
dataset.drop(columns=['region'],axis=1,inplace=True)

In [8]:
dataset.head()

,age,bmi,children,charges,Gender,Smoker,Northeast,Northwest,Southeast,Southwest
0,19,27.900,0,16884.92400,1,1,0,0,0,1
1,18,33.770,1,1725.55230,0,0,0,0,1,0
2,28,33.000,3,4449.46200,0,0,0,0,1,0
3,33,22.705,0,21984.47061,0,0,0,1,0,0
4,32,28.880,0,3866.85520,0,0,0,1,0,0